una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m0.h
/* Reset status register 2 */
typedef struct {
  __REG32  TIMER0_RST         : 2;
  __REG32  TIMER1_RST         : 2;
  __REG32  TIMER2_RST         : 2;
  __REG32  TIMER3_RST         : 2;
  __REG32  RITIMER_RST        : 2;
  __REG32  SCT_RST            : 2;
  __REG32  MOTOCONPWM_RST     : 2;
  __REG32  				            : 2;
  __REG32  ADC0_RST           : 2;
  __REG32  ADC1_RST           : 2;
  __REG32  DAC_RST            : 2;
  __REG32                     : 2;
  __REG32  UART0_RST          : 2;
  __REG32  UART1_RST          : 2;
  __REG32  UART2_RST          : 2;
  __REG32  UART3_RST          : 2;
} __rgu_reset_status2_bits;

/* Reset status register 3 */
typedef struct {
  __REG32  I2C0_RST           : 2;
  __REG32  I2C1_RST           : 2;
  __REG32  SSP0_RST           : 2;
  __REG32  SSP1_RST           : 2;
  __REG32  I2S_RST            : 2;
  __REG32  SPIFI_RST          : 2;
  __REG32  CAN1_RST           : 2;
  __REG32  CAN0_RST           : 2;
  __REG32  M0APP_RST          : 2;
  __REG32  SGPIO_RST          : 2;
  __REG32  SPI_RST            : 2;
  __REG32                     :10;
} __rgu_reset_status3_bits;

/* Reset external status register 0 */
typedef struct {
  __REG32  EXT_RESET          : 1;
  __REG32                     : 3;
  __REG32  BOD_RESET          : 1;
  __REG32  WWDT_RESET         : 1;
  __REG32                     :26;
} __rgu_reset_ext_stat0_bits;

/* Reset external status register 1 */
typedef struct {
  __REG32                     : 1;
  __REG32  CORE_RESET         : 1;
  __REG32                     :30;
} __rgu_reset_ext_stat1_bits;

/* Reset external status register 2 */
typedef struct {
  __REG32                     : 2;
  __REG32  PERIPHERAL_RESET   : 1;
  __REG32                     :29;
} __rgu_reset_ext_stat2_bits;

/* Reset external status register 4 */
typedef struct {
  __REG32                     : 1;
  __REG32  CORE_RESET         : 1;
  __REG32                     :30;
} __rgu_reset_ext_stat4_bits;

/* Reset external status register 5 */
typedef struct {
  __REG32                     : 1;
  __REG32  CORE_RESET         : 1;
  __REG32                     :30;
} __rgu_reset_ext_stat5_bits;

/* Reset external status registers for PERIPHERAL_RESET */
typedef struct {
  __REG32                     : 2;
  __REG32  PERIPHERAL_RESET   : 1;
  __REG32                     :29;
} __rgu_peripheral_reset_bits;

/* Reset external status registers for MASTER_RESET */
typedef struct {
  __REG32                     : 3;
  __REG32  MASTER_RESET       : 1;
  __REG32                     :28;
} __rgu_master_reset_bits;


/* Pin configuration registers for normal drive pins - pins P0_0 to PF_11 and CLK0 to CLK3 */
/* Pin configuration registers for high speed pins - pins P0_0 to PF_11 and CLK0 to CLK3 */
typedef struct {
  __REG32  MODE               : 3;
  __REG32  EPD                : 1;
  __REG32  EPUN               : 1;
  __REG32  EHS                : 1;
  __REG32  EZI                : 1;
  __REG32  ZIF                : 1;
  __REG32                     :24;
} __scu_sfspx_normdrv_hispd_bits;

/* Pin configuration registers for high drive pins - pins P0_0 to PF_11 and CLK0 to CLK3 */
typedef struct {
  __REG32  MODE               : 3;
  __REG32  EPD                : 1;
  __REG32  EPUN               : 1;
  __REG32                     : 1;
  __REG32  EZI                : 1;
  __REG32  ZIF                : 1;
  __REG32  EHD                : 2;
  __REG32                     :22;
} __scu_sfspx_hidrv_bits;

/* Pin configuration register for open-drain I2C-bus pins */
typedef struct {
  __REG32  SCL_EFP            : 1;
  __REG32                     : 1;
  __REG32  SCL_EHD            : 1;
  __REG32  SCL_EZI            : 1;
  __REG32                     : 3;
  __REG32  SCL_ZIF            : 1;
  __REG32  SDA_EFP            : 1;
  __REG32                     : 1;
  __REG32  SDA_EHD            : 1;
  __REG32  SDA_EZI            : 1;
  __REG32                     : 3;
  __REG32  SDA_ZIF            : 1;
  __REG32                     :16;
} __scu_sfsi2c0_bits;

/* ADC0 function select register */
typedef struct {
  __REG32  ADC0_0             : 1;
  __REG32  ADC0_1             : 1;
  __REG32  ADC0_2             : 1;
  __REG32  ADC0_3             : 1;
  __REG32  ADC0_4             : 1;
  __REG32  ADC0_5             : 1;
  __REG32  ADC0_6             : 1;
  __REG32                     :25;
} __scu_enaio0_bits;

/* ADC1 function select register */
typedef struct {
  __REG32  ADC1_0             : 1;
  __REG32  ADC1_1             : 1;
  __REG32  ADC1_2             : 1;
  __REG32  ADC1_3             : 1;
  __REG32  ADC1_4             : 1;
  __REG32  ADC1_5             : 1;
  __REG32  ADC1_6             : 1;
  __REG32  ADC1_7             : 1;
  __REG32                     :24;
} __scu_enaio1_bits;

/* Analog function select register */
typedef struct {
  __REG32  DAC                : 1;
  __REG32                     : 3;
  __REG32  BG                 : 1;
  __REG32                     :27;
} __scu_enaio2_bits;

/* EMC clock delay register */
typedef struct {
  __REG32  CLK_DELAY          :16;
  __REG32                     :16;
} __scu_emcdelayclk_bits;

/* Pin interrupt select register 0 */
typedef struct {
  __REG32  INTPIN0            : 5;
  __REG32  PORTSEL0           : 3;
  __REG32  INTPIN1            : 5;
  __REG32  PORTSEL1           : 3;
  __REG32  INTPIN2            : 5;
  __REG32  PORTSEL2           : 3;
  __REG32  INTPIN3            : 5;
  __REG32  PORTSEL3           : 3;
} __scu_pintsel0_bits;

/* Pin interrupt select register 1 */
typedef struct {
  __REG32  INTPIN4            : 5;
  __REG32  PORTSEL4           : 3;
  __REG32  INTPIN5            : 5;
  __REG32  PORTSEL5           : 3;
  __REG32  INTPIN6            : 5;
  __REG32  PORTSEL6           : 3;
  __REG32  INTPIN7            : 5;
  __REG32  PORTSEL7           : 3;
} __scu_pintsel1_bits;


/* Input multiplexer registers */
typedef struct {
  __REG32  INV                : 1;
  __REG32  EDGE               : 1;
  __REG32  SYNCH              : 1;
  __REG32  PULSE              : 1;
  __REG32  SELECT             : 4;
  __REG32                     :24;
} __gima_in_bits;


/* Pin interrupt mode register */
typedef struct {
  __REG32  PMODE              : 8;
  __REG32                     :24;
} __gpio_isel_bits;

/* Pin interrupt level enable register */
typedef struct {
  __REG32  ENRL               : 8;
  __REG32                     :24;
} __gpio_ienr_bits;

/* Pin interrupt level set register */

#define GPIO_SIENR_SETENRL         (0x000000FFUL)

/* Pin interrupt level clear register */

#define GPIO_CIENR_CENRL           (0x000000FFUL)

/* Pin interrupt active level register */
typedef struct {
  __REG32  ENAF               : 8;
  __REG32                     :24;
} __gpio_ienf_bits;

/* Pin interrupt active level set register */

#define GPIO_SIENF_SETENAF         (0x000000FFUL)

/* Pin interrupt active level clear register */

