una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m0.h
/* SDIO UHS-1 register */
typedef struct{
__REG32 VOLT_REG            : 1;
__REG32                     :15;
__REG32 DDR_REG             : 1;
__REG32                     :15;
} __sdio_uhs_reg_bits;

/* SDIO Hardware Reset register */
typedef struct{
__REG32 CARD_RESET          : 1;
__REG32                     :31;
} __sdio_rst_n_bits;

/* SDIO Bus Mode register */
typedef struct{
__REG32 SWR                 : 1;
__REG32 FB                  : 1;
__REG32 DSL                 : 5;
__REG32 DE                  : 1;
__REG32 PBL                 : 3;
__REG32                     :21;
} __sdio_bmod_bits;

/* SDIO Internal DMAC Status register */
typedef struct{
__REG32 TI                  : 1;
__REG32 RI                  : 1;
__REG32 FBE                 : 1;
__REG32                     : 1;
__REG32 DU                  : 1;
__REG32 CES                 : 1;
__REG32                     : 2;
__REG32 NIS                 : 1;
__REG32 AIS                 : 1;
__REG32 EB                  : 3;
__REG32 FSM                 : 4;
__REG32                     :15;
} __sdio_idsts_bits;

/* SDIO Internal DMAC Interrupt Enable register */
typedef struct{
__REG32 TI                  : 1;
__REG32 RI                  : 1;
__REG32 FBE                 : 1;
__REG32                     : 1;
__REG32 DU                  : 1;
__REG32 CES                 : 1;
__REG32                     : 2;
__REG32 NIS                 : 1;
__REG32 AIS                 : 1;
__REG32                     :22;
} __sdio_idinten_bits;


/* EMC Control Register */
typedef struct {
  __REG32 E         : 1;
  __REG32 M         : 1;
  __REG32 L         : 1;
  __REG32           :29;
} __emc_control_bits;

/* EMC Status Register */
typedef struct {
  __REG32 B         : 1;
  __REG32 S         : 1;
  __REG32 SA        : 1;
  __REG32           :29;
} __emc_status_bits;

/* EMC Configuration Register */
typedef struct {
  __REG32 EM        : 1;
  __REG32           : 7;
  __REG32 CR        : 1;
  __REG32           :23;
} __emc_config_bits;

/* Dynamic Memory Control Register */
typedef struct {
  __REG32 CE        : 1;
  __REG32 CS        : 1;
  __REG32 SR        : 1;
  __REG32           : 2;
  __REG32 MMC       : 1;
  __REG32           : 1;
  __REG32 I         : 2;
  __REG32           : 4;
  __REG32 DP        : 1;
  __REG32           :18;
} __emc_dctrl_bits;

/* Dynamic Memory Refresh Timer Register */
typedef struct {
  __REG32 REFRESH   :11;
  __REG32           :21;
} __emc_drfr_bits;

/* Dynamic Memory Read Configuration Register */
typedef struct {
  __REG32 RD        : 2;
  __REG32           :30;
} __emc_drdcfg_bits;

/* Dynamic Memory Percentage Command Period Register */
typedef struct {
  __REG32 tRP       : 4;
  __REG32           :28;
} __emc_drp_bits;

/* Dynamic Memory Active to Precharge Command Period Register */
typedef struct {
  __REG32 tRAS      : 4;
  __REG32           :28;
} __emc_dras_bits;

/* Dynamic Memory Self-refresh Exit Time Register */
typedef struct {
  __REG32 tSREX     : 4;
  __REG32           :28;
} __emc_dsrex_bits;

/* Dynamic Memory Last Data Out to Active Time Register */
typedef struct {
  __REG32 tAPR      : 4;
  __REG32           :28;
} __emc_dapr_bits;

/* Dynamic Memory Data-in to Active Command Time Register */
typedef struct {
  __REG32 tDAL      : 4;
  __REG32           :28;
} __emc_ddal_bits;

/* Dynamic Memory Write Recovery Time Register */
typedef struct {
  __REG32 tWR       : 4;
  __REG32           :28;
} __emc_dwr_bits;

/* Dynamic Memory Active to Active Command Period Register */
typedef struct {
  __REG32 tRC       : 5;
  __REG32           :27;
} __emc_drc_bits;

/* Dynamic Memory Auto-refresh Period Register */
typedef struct {
  __REG32 tRFC      : 5;
  __REG32           :27;
} __emc_drfc_bits;

/* Dynamic Memory Exit Self-refresh Register */
typedef struct {
  __REG32 tXSR      : 5;
  __REG32           :27;
} __emc_dxsr_bits;

/* Dynamic Memory Active Bank A to Active Bank B Time Register */
typedef struct {
  __REG32 tRRD      : 4;
  __REG32           :28;
} __emc_drrd_bits;

/* Dynamic Memory Load Mode Register to Active Command Time */
typedef struct {
  __REG32 tMRD      : 4;
  __REG32           :28;
} __emc_dmrd_bits;

/* Static Memory Extended Wait Register */
typedef struct {
  __REG32 EXTENDEDWAIT  :10;
  __REG32               :22;
} __emc_s_ext_wait_bits;

/* Dynamic Memory Configuration Registers */
typedef struct {
  __REG32           : 3;
  __REG32 MD        : 2;
  __REG32           : 2;
  __REG32 AM0       : 6;
  __REG32           : 1;
  __REG32 AM1       : 1;
  __REG32           : 4;
  __REG32 B         : 1;
  __REG32 P         : 1;
  __REG32           :11;
} __emc_d_config_bits;

/* Dynamic Memory RAS & CAS Delay Registers */
typedef struct {
  __REG32 RAS       : 2;
  __REG32           : 6;
  __REG32 CAS       : 2;
  __REG32           :22;
} __emc_d_ras_cas_bits;

/* Static Memory Configuration Registers */
typedef struct {
  __REG32 MW        : 2;
  __REG32           : 1;
  __REG32 PM        : 1;
  __REG32           : 2;
  __REG32 PC        : 1;
  __REG32 PB        : 1;
  __REG32 EW        : 1;
  __REG32           :10;
  __REG32 B         : 1;
  __REG32 P         : 1;
  __REG32           :11;
} __emc_s_config_bits;

/* Static Memory Write Enable Delay Registers */
typedef struct {
  __REG32 WAITWEN   : 4;
  __REG32           :28;
} __emc_s_wait_wen_bits;

/* Static Memory Output Enable Delay Registers */
typedef struct {
  __REG32 WAITOEN   : 4;
  __REG32           :28;
} __emc_s_wait_oen_bits;

/* Static Memory Read Delay Registers */
typedef struct {
  __REG32 WAITRD    : 5;
  __REG32           :27;
} __emc_s_wait_rd_bits;

/* Static Memory Page Mode Read Delay Registers */
typedef struct {
  __REG32 WAITPAGE  : 5;
  __REG32           :27;
} __emc_s_wait_pg_bits;

/* Static Memory Write Delay Registers */
typedef struct {
  __REG32 WAITWR    : 5;
  __REG32           :27;
} __emc_s_wait_wr_bits;

/* Static Memory Turn Round Delay Registers */
typedef struct {
  __REG32 WAITTURN  : 4;
  __REG32           :28;
} __emc_s_wait_turn_bits;


/* SCT configuration register */
typedef struct{
__REG32 UNIFY                 : 1;
__REG32 CLKMODE               : 2;
__REG32 CLKSEL                : 4;
__REG32 NORELAODL_NORELOADU   : 1;
__REG32 NORELOADH             : 1;
__REG32 INSYNC0               : 1;
__REG32 INSYNC1               : 1;
__REG32 INSYNC2               : 1;
__REG32 INSYNC3               : 1;
__REG32 INSYNC4               : 1;
__REG32 INSYNC5               : 1;
__REG32 INSYNC6               : 1;
__REG32 INSYNC7               : 1;
__REG32                       :15;
} __sct_config_bits;

/* SCT control register */
typedef union{
  /* SCT_CTRL */
  struct{
  __REG32 DOWN_L                : 1;
  __REG32 STOP_L                : 1;
  __REG32 HALT_L                : 1;
  __REG32 CLRCTR_L              : 1;
  __REG32 BIDIR_L               : 1;
  __REG32 PRE_L                 : 8;
  __REG32                       : 3;
  __REG32 DOWN_H                : 1;
  __REG32 STOP_H                : 1;
  __REG32 HALT_H                : 1;
  __REG32 CLRCTR_H              : 1;
  __REG32 BIDIR_H               : 1;
  __REG32 PRE_H                 : 8;
  __REG32                       : 3;
  };

  struct{
    union{
      /* SCT_CTRL_L */
      struct{
      __REG16 DOWN_L                : 1;
      __REG16 STOP_L                : 1;
      __REG16 HALT_L                : 1;
      __REG16 CLRCTR_L              : 1;
      __REG16 BIDIR_L               : 1;
      __REG16 PRE_L                 : 8;
      __REG16                       : 3;
      } __sct_ctrl_l_bits;
      __REG16 __sct_ctrl_l;
    };
    union{
      /* SCT_CTRL_H */
      struct{
      __REG16 DOWN_H                : 1;
      __REG16 STOP_H                : 1;
      __REG16 HALT_H                : 1;
      __REG16 CLRCTR_H              : 1;
      __REG16 BIDIR_H               : 1;
      __REG16 PRE_H                 : 8;
      __REG16                       : 3;
      } __sct_ctrl_h_bits;
      __REG16 __sct_ctrl_h;
    };
  };
} __sct_ctrl_bits;


/* SCT limit register */
typedef union{
  /* SCT_LIMIT */
  struct{
  __REG32 LIMMSK0_L             : 1;
  __REG32 LIMMSK1_L             : 1;
  __REG32 LIMMSK2_L             : 1;
  __REG32 LIMMSK3_L             : 1;
  __REG32 LIMMSK4_L             : 1;
  __REG32 LIMMSK5_L             : 1;
  __REG32 LIMMSK6_L             : 1;
  __REG32 LIMMSK7_L             : 1;
  __REG32 LIMMSK8_L             : 1;
  __REG32 LIMMSK9_L             : 1;
  __REG32 LIMMSK10_L            : 1;
  __REG32 LIMMSK11_L            : 1;
  __REG32 LIMMSK12_L            : 1;
  __REG32 LIMMSK13_L            : 1;
  __REG32 LIMMSK14_L            : 1;
  __REG32 LIMMSK15_L            : 1;
  __REG32 LIMMSK0_H             : 1;
  __REG32 LIMMSK1_H             : 1;
  __REG32 LIMMSK2_H             : 1;
  __REG32 LIMMSK3_H             : 1;
  __REG32 LIMMSK4_H             : 1;
  __REG32 LIMMSK5_H             : 1;
  __REG32 LIMMSK6_H             : 1;
  __REG32 LIMMSK7_H             : 1;
  __REG32 LIMMSK8_H             : 1;
  __REG32 LIMMSK9_H             : 1;
  __REG32 LIMMSK10_H            : 1;
  __REG32 LIMMSK11_H            : 1;
  __REG32 LIMMSK12_H            : 1;
  __REG32 LIMMSK13_H            : 1;
  __REG32 LIMMSK14_H            : 1;
  __REG32 LIMMSK15_H            : 1;
  };

  struct{
    union{
      /* SCT_LIMIT_L */
      struct{
      __REG16 LIMMSK0_L             : 1;
      __REG16 LIMMSK1_L             : 1;
      __REG16 LIMMSK2_L             : 1;
      __REG16 LIMMSK3_L             : 1;
      __REG16 LIMMSK4_L             : 1;
      __REG16 LIMMSK5_L             : 1;
      __REG16 LIMMSK6_L             : 1;
      __REG16 LIMMSK7_L             : 1;
      __REG16 LIMMSK8_L             : 1;
      __REG16 LIMMSK9_L             : 1;
      __REG16 LIMMSK10_L            : 1;
      __REG16 LIMMSK11_L            : 1;
      __REG16 LIMMSK12_L            : 1;
      __REG16 LIMMSK13_L            : 1;
      __REG16 LIMMSK14_L            : 1;
      __REG16 LIMMSK15_L            : 1;
      } __sct_limit_l_bits;
      __REG16 __sct_limit_l;
    };
    union{
      /* SCT_LIMIT_H */
      struct{
      __REG16 LIMMSK0_H             : 1;
      __REG16 LIMMSK1_H             : 1;
      __REG16 LIMMSK2_H             : 1;
      __REG16 LIMMSK3_H             : 1;
      __REG16 LIMMSK4_H             : 1;
      __REG16 LIMMSK5_H             : 1;
      __REG16 LIMMSK6_H             : 1;
      __REG16 LIMMSK7_H             : 1;
      __REG16 LIMMSK8_H             : 1;
      __REG16 LIMMSK9_H             : 1;
      __REG16 LIMMSK10_H            : 1;
      __REG16 LIMMSK11_H            : 1;
      __REG16 LIMMSK12_H            : 1;
      __REG16 LIMMSK13_H            : 1;
      __REG16 LIMMSK14_H            : 1;
      __REG16 LIMMSK15_H            : 1;
      } __sct_limit_h_bits;
      __REG16 __sct_limit_h;
    };
  };
} __sct_limit_bits;

