una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m0.h
/* Capture clear register */

#define MC_CAP_CLR_CAP_CLR0     (0x000000001UL)
#define MC_CAP_CLR_CAP_CLR1     (0x000000002UL)
#define MC_CAP_CLR_CAP_CLR2     (0x000000004UL)

/* RIT Control register */
typedef struct{
__REG32 RITINT   : 1;
__REG32 RITENCLR : 1;
__REG32 RITENBR  : 1;
__REG32 RITEN    : 1;
__REG32          :28;
} __rit_ctrl_bits;


/* Downcounter register */
typedef struct{
__REG32 CVAL     :16;
__REG32          :16;
} __at_downcounter_bits;

/* Preset value register */
typedef struct{
__REG32 PRESETVAL :16;
__REG32           :16;
} __at_preset_bits;

/* Interrupt clear enable register */

#define AT_CLR_EN_CLR_EN      (0x00000001UL)

/* Interrupt set enable register */

#define AT_SET_EN_SET_EN      (0x00000001UL)

/* Interrupt status register */
typedef struct{
__REG32 STAT     : 1;
__REG32          :31;
} __at_status_bits;

/* Interrupt enable register */
typedef struct{
__REG32 EN       : 1;
__REG32          :31;
} __at_enable_bits;

/* Clear status register */

#define AT_CLR_STAT_CSTAT     (0x00000001UL)

/* Set status register */

#define AT_SET_STAT_SSTAT     (0x00000001UL)

/* Watchdog mode register */
typedef struct{
__REG32 WDEN     : 1;
__REG32 WDRESET  : 1;
__REG32 WDTOF    : 1;
__REG32 WDINT    : 1;
__REG32 WDPROTECT: 1;
__REG32          :27;
} __wwdt_mod_bits;

/* Watchdog Timer Constant register */
typedef struct{
__REG32 WDTC     :24;
__REG32          : 8;
} __wwdt_tc_bits;

/* Watchdog feed register */

#define WWDT_FEED_Feed     (0x000000FFUL)

/* Watchdog Timer Value register */
typedef struct{
__REG32 Count    :24;
__REG32          : 8;
} __wwdt_tv_bits;

/* Watchdog Timer Warning Interrupt register */
typedef struct{
__REG32 WDWARNINT :10;
__REG32           :22;
} __wwdt_warnint_bits;

/* Watchdog Timer Window register */
typedef struct{
__REG32 WDWINDOW  :24;
__REG32           : 8;
} __wwdt_window_bits;


/* RTC interrupt location register */

#define RTC_ILR_RTCCIF     (0x00000001UL)
#define RTC_ILR_RTCALF     (0x00000002UL)

/* RTC clock control register */
typedef struct{
__REG32 CLKEN   : 1;
__REG32 CTCRST  : 1;
__REG32         : 2;
__REG32 CCALEN  : 1;
__REG32         :27;
} __rtc_ccr_bits;

/* RTC counter increment interrupt register */
typedef struct{
__REG32 IMSEC   : 1;
__REG32 IMMIN   : 1;
__REG32 IMHOUR  : 1;
__REG32 IMDOM   : 1;
__REG32 IMDOW   : 1;
__REG32 IMDOY   : 1;
__REG32 IMMON   : 1;
__REG32 IMYEAR  : 1;
__REG32         :24;
} __rtc_ciir_bits;

/* RTC Counter Increment Select Mask Register */
typedef struct{
__REG32 CALVAL    :17;
__REG32 CALDIR    : 1;
__REG32           :14;
} __rtc_calibration_bits;

/* RTC alarm mask register */
typedef struct{
__REG32 AMRSEC   : 1;
__REG32 AMRMIN   : 1;
__REG32 AMRHOUR  : 1;
__REG32 AMRDOM   : 1;
__REG32 AMRDOW   : 1;
__REG32 AMRDOY   : 1;
__REG32 AMRMON   : 1;
__REG32 AMRYEAR  : 1;
__REG32          :24;
} __rtc_amr_bits;

/* RTC consolidated time register 0 */
typedef struct{
__REG32 SECONDS : 6;
__REG32         : 2;
__REG32 MINUTES : 6;
__REG32         : 2;
__REG32 HOURS   : 5;
__REG32         : 3;
__REG32 DOW     : 3;
__REG32         : 5;
} __rtc_ctime0_bits;

/* RTC consolidated time register 1 */
typedef struct{
__REG32 DOM   : 5;
__REG32       : 3;
__REG32 MONTH : 4;
__REG32       : 4;
__REG32 YEAR  :12;
__REG32       : 4;
} __rtc_ctime1_bits;

/* RTC consolidated time register 2 */
typedef struct{
__REG32 DOY  :12;
__REG32      :20;
} __rtc_ctime2_bits;

/* RTC second register */
typedef struct{
__REG32 SECONDS : 6;
__REG32         :26;
} __rtc_sec_bits;

/* RTC minute register */
typedef struct{
__REG32 MINUTES : 6;
__REG32         :26;
} __rtc_min_bits;

/* RTC hour register */
typedef struct{
__REG32 HOURS : 5;
__REG32       :27;
} __rtc_hour_bits;

/* RTC day of month register */
typedef struct{
__REG32 DOM  : 5;
__REG32      :27;
} __rtc_dom_bits;

/* RTC day of week register */
typedef struct{
__REG32 DOW  : 3;
__REG32      :29;
} __rtc_dow_bits;

/* RTC day of year register */
typedef struct{
__REG32 DOY  : 9;
__REG32      :23;
} __rtc_doy_bits;

/* RTC month register */
typedef struct{
__REG32 MONTH : 4;
__REG32       :28;
} __rtc_month_bits;

/* RTC year register */
typedef struct{
__REG32 YEAR :12;
__REG32      :20;
} __rtc_year_bits;


/* UART Receive Buffer Register (RBR) */
/* UART Transmit Holding Register (THR) */
/* UART Divisor Latch Register  Low (DLL) */
typedef union {
  /*UxRBR*/
  struct {
    __REG32 RBR           : 8;
    __REG32               :24;
  };
  /*UxTHR*/
  struct {
    __REG32 THR           : 8;
    __REG32               :24;
  };
  /*UxDLL*/
  struct {
    __REG32 DLLSB         : 8;
    __REG32               :24;
  };
} __uart_rbr_bits;

/* UART interrupt enable register */
typedef union {
  /*UxIER*/
  struct{
    __REG32 RBRIE     : 1;
    __REG32 THREIE    : 1;
    __REG32 RXIE      : 1;
    __REG32           : 5;
    __REG32 ABEOINTEN : 1;
    __REG32 ABTOINTEN : 1;
    __REG32           :22;
  };
  /*UxDLM*/
  struct {
    __REG32 DLMSB         : 8;
    __REG32               :24;
  };
} __uart_ier_bits;

//* UART interrupt enable register */
typedef union {
  /*U1IER*/
  struct{
    __REG32 RBRIE     : 1;
    __REG32 THREIE    : 1;
    __REG32 RXIE      : 1;
    __REG32 MSIE      : 1;
    __REG32           : 3;
    __REG32 CTSIE     : 1;
    __REG32 ABEOIE    : 1;
    __REG32 ABTOIE    : 1;
    __REG32           :22;
  };
  /*U1DLM*/
  struct {
    __REG32 DLMSB         : 8;
    __REG32               :24;
  };
} __uart1_ier_bits;


/* UART Transmit Enable Register */
typedef struct{
  __REG32 TXEN            : 1;
  __REG32                 :31;
} __uart_ter_bits;

/* UART Scratch Pad Register */
typedef struct{
  __REG32 PAD             : 8;
  __REG32                 :24;
} __uart_scr_bits;

