una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m0.h
/* SPI clock counter register */
typedef struct{
__REG32 COUNTER  : 8;
__REG32          :24;
} __spi_ccr_bits;

/* SPI Data Register */
typedef struct{
__REG32 DATALOW  : 8;
__REG32 DATAHIGH : 8;
__REG32          :16;
} __spi_dr_bits;

/* SPI interrupt register */
typedef struct{
__REG32 SPIIF   : 1;
__REG32         :31;
} __spi_int_bits;

/* SPI Test control register */
typedef struct{
__REG32          : 1;
__REG32  TEST    : 7;
__REG32          :24;
} __spi_tcr_bits;

/* SPI Test Status Register */
typedef struct{
__REG32          : 3;
__REG32  ABRT    : 1;
__REG32  MODF    : 1;
__REG32  ROVR    : 1;
__REG32  WCOL    : 1;
__REG32  SPIF    : 1;
__REG32          :24;
} __spi_tsr_bits;


/* OTP Bank 3  Word 0 */
typedef struct{
__REG32                    :25;
__REG32  BOOT_SRC          : 4;
__REG32  AES_KEY2_LOCK     : 1;
__REG32  AES_KEY1_LOCK     : 1;
__REG32  JTAG_DISABLE      : 1;
} __otp_b3_w0_bits;

#endif    /* __IAR_SYSTEMS_ICC__ */

/* Declarations common to compiler and assembler **************************/

/***************************************************************************
 **
 ** SCS
 **
 ***************************************************************************/
__IO_REG32_BIT(SYST_CSR,              0xE000E010,__READ_WRITE ,__syst_csr_bits);
__IO_REG32_BIT(SYST_RVR,              0xE000E014,__READ_WRITE ,__syst_rvr_bits);
__IO_REG32_BIT(SYST_CVR,              0xE000E018,__READ_WRITE ,__syst_cvr_bits);
__IO_REG32_BIT(SYST_CALIB,            0xE000E01C,__READ       ,__syst_calvr_bits);

__IO_REG32_BIT(NVIC_ISER,             0xE000E100,__READ_WRITE ,__nvic_iser_bits);
__IO_REG32_BIT(NVIC_ICER,             0xE000E180,__READ_WRITE ,__nvic_icer_bits);
__IO_REG32_BIT(NVIC_ISPR,             0xE000E200,__READ_WRITE ,__nvic_ispr_bits);
__IO_REG32_BIT(NVIC_ICPR,             0xE000E280,__READ_WRITE ,__nvic_icpr_bits);

__IO_REG32_BIT(NVIC_IPR0,             0xE000E400,__READ_WRITE ,__nvic_ipr0_bits);
__IO_REG32_BIT(NVIC_IPR1,             0xE000E404,__READ_WRITE ,__nvic_ipr1_bits);
__IO_REG32_BIT(NVIC_IPR2,             0xE000E408,__READ_WRITE ,__nvic_ipr2_bits);
__IO_REG32_BIT(NVIC_IPR3,             0xE000E40C,__READ_WRITE ,__nvic_ipr3_bits);
__IO_REG32_BIT(NVIC_IPR4,             0xE000E410,__READ_WRITE ,__nvic_ipr4_bits);
__IO_REG32_BIT(NVIC_IPR5,             0xE000E414,__READ_WRITE ,__nvic_ipr5_bits);
__IO_REG32_BIT(NVIC_IPR6,             0xE000E418,__READ_WRITE ,__nvic_ipr6_bits);
__IO_REG32_BIT(NVIC_IPR7,             0xE000E41C,__READ_WRITE ,__nvic_ipr7_bits);

__IO_REG32_BIT(CPUID,                 0xE000ED00,__READ       ,__cpuid_bits);
__IO_REG32_BIT(ICSR,                  0xE000ED04,__READ_WRITE ,__icsr_bits);
__IO_REG32_BIT(AIRCR,                 0xE000ED0C,__READ_WRITE ,__aircr_bits);
__IO_REG32_BIT(SCR,                   0xE000ED10,__READ_WRITE ,__scr_bits);
__IO_REG32_BIT(CCR,                   0xE000ED14,__READ_WRITE ,__ccr_bits);
__IO_REG32_BIT(SHPR2,                 0xE000ED1C,__READ_WRITE ,__nvic_ipr2_bits);
__IO_REG32_BIT(SHPR3,                 0xE000ED20,__READ_WRITE ,__nvic_ipr3_bits);

/***************************************************************************
 **
 ** MPU
 **
 ***************************************************************************/
__IO_REG32_BIT(MPU_TYPE,              0xE000ED90,__READ       ,__mpu_type_bits);
__IO_REG32_BIT(MPU_CTRL,              0xE000ED94,__READ_WRITE ,__mpu_ctrl_bits);
__IO_REG32_BIT(MPU_RNR,               0xE000ED98,__READ_WRITE ,__mpu_rnr_bits);
__IO_REG32_BIT(MPU_RBAR,              0xE000ED9C,__READ_WRITE ,__mpu_rbar_bits);
__IO_REG32_BIT(MPU_RASR,              0xE000EDA0,__READ_WRITE ,__mpu_rasr_bits);
__IO_REG32_BIT(MPU_RBAR_A1,           0xE000EDA4,__READ_WRITE ,__mpu_rbar_bits);
__IO_REG32_BIT(MPU_RASR_A1,           0xE000EDA8,__READ_WRITE ,__mpu_rasr_bits);
__IO_REG32_BIT(MPU_RBAR_A2,           0xE000EDAC,__READ_WRITE ,__mpu_rbar_bits);
__IO_REG32_BIT(MPU_RASR_A2,           0xE000EDB0,__READ_WRITE ,__mpu_rasr_bits);
__IO_REG32_BIT(MPU_RBAR_A3,           0xE000EDB4,__READ_WRITE ,__mpu_rbar_bits);
__IO_REG32_BIT(MPU_RASR_A3,           0xE000EDB8,__READ_WRITE ,__mpu_rasr_bits);

/***************************************************************************
 **
 ** OTP
 **
 ***************************************************************************/
__IO_REG32(    OTP_B0W0,              0x40045000,__READ_WRITE );
__IO_REG32(    OTP_B0W1,              0x40045004,__READ_WRITE );
__IO_REG32(    OTP_B0W2,              0x40045008,__READ_WRITE );
__IO_REG32(    OTP_B0W3,              0x4004500C,__READ_WRITE );
__IO_REG32(    OTP_B1W0,              0x40045010,__READ_WRITE );
__IO_REG32(    OTP_B1W1,              0x40045014,__READ_WRITE );
__IO_REG32(    OTP_B1W2,              0x40045018,__READ_WRITE );
__IO_REG32(    OTP_B1W3,              0x4004501C,__READ_WRITE );
__IO_REG32(    OTP_B2W0,              0x40045020,__READ_WRITE );
__IO_REG32(    OTP_B2W1,              0x40045024,__READ_WRITE );
__IO_REG32(    OTP_B2W2,              0x40045028,__READ_WRITE );
__IO_REG32(    OTP_B2W3,              0x4004502C,__READ_WRITE );
__IO_REG32_BIT(OTP_B3W0,              0x40045030,__READ_WRITE ,__otp_b3_w0_bits);
__IO_REG32(    OTP_B3W3,              0x4004503C,__READ_WRITE );

/***************************************************************************
 **
 ** ER (Event router)
 **
 ***************************************************************************/
__IO_REG32_BIT(ER_HILO,               0x40044000,__READ_WRITE ,__er_hilo_bits);
__IO_REG32_BIT(ER_EDGE,               0x40044004,__READ_WRITE ,__er_edge_bits);
__IO_REG32(    ER_CLR_EN,             0x40044FD8,__WRITE      );
__IO_REG32(    ER_SET_EN,             0x40044FDC,__WRITE      );
__IO_REG32_BIT(ER_STATUS,             0x40044FE0,__READ       ,__er_status_bits);
__IO_REG32_BIT(ER_ENABLE,             0x40044FE4,__READ       ,__er_enable_bits);
__IO_REG32(    ER_CLR_STAT,           0x40044FE8,__WRITE      );
__IO_REG32(    ER_SET_STAT,           0x40044FEC,__WRITE      );

/***************************************************************************
 **
 ** CREG (Configuration registers)
 **
 ***************************************************************************/
__IO_REG32_BIT(CREG_CREG0,            0x40043004,__READ_WRITE ,__creg_creg0_bits);
/*__IO_REG32_BIT(CREG_PMUCON,           0x40043008,__READ_WRITE ,__creg_pmucon_bits);*/
__IO_REG32_BIT(CREG_M4MEMMAP,         0x40043100,__READ_WRITE ,__creg_m4memmap_bits);
__IO_REG32(    CREG_CREG1,            0x40043108,__READ       );
__IO_REG32(    CREG_CREG2,            0x4004310C,__READ       );
__IO_REG32(    CREG_CREG3,            0x40043110,__READ       );
__IO_REG32(    CREG_CREG4,            0x40043114,__READ       );
__IO_REG32_BIT(CREG_CREG5,            0x40043118,__READ_WRITE ,__creg_creg5_bits);
__IO_REG32_BIT(CREG_DMAMUX,           0x4004311C,__READ_WRITE ,__creg_dmamux_bits);
__IO_REG32_BIT(CREG_ETBCFG,           0x40043128,__READ_WRITE ,__creg_etbcfg_bits);
__IO_REG32_BIT(CREG_CREG6,            0x4004312C,__READ_WRITE ,__creg_creg6_bits);
__IO_REG32_BIT(CREG_M4TXEVENT,        0x40043130,__READ_WRITE ,__creg_m4txevent_bits);
__IO_REG32(    CREG_CHIPID,           0x40043200,__READ       );
__IO_REG32_BIT(CREG_M0TXEVENT,        0x40043400,__READ_WRITE ,__creg_m0txevent_bits);
__IO_REG32_BIT(CREG_M0APPMEMMAP,      0x40043404,__READ_WRITE ,__creg_m0appmemmap_bits);

/***************************************************************************
 **
 ** PMC (Power Management Controller)
 **
 ***************************************************************************/
__IO_REG32_BIT(PMC_PD0_SLEEP0_HW_ENA,     0x40042000,__READ_WRITE ,__pmc_pd0_sleep0_hw_ena_bits);
__IO_REG32_BIT(PMC_PD0_SLEEP0_MODE,       0x4004201C,__READ_WRITE ,__pmc_pd0_sleep0_mode_bits);

/***************************************************************************
 **
 ** CGU
 **
 ***************************************************************************/
__IO_REG32_BIT(CGU_FREQ_MON,          0x40050014,__READ_WRITE ,__cgu_freq_mon_bits);
__IO_REG32_BIT(CGU_XTAL_OSC_CTRL,     0x40050018,__READ_WRITE ,__cgu_xtal_osc_ctrl_bits);
__IO_REG32_BIT(CGU_PLL0AUDIO_STAT,    0x4005002C,__READ       ,__cgu_pll0audio_stat_bits);
__IO_REG32_BIT(CGU_PLL0AUDIO_CTRL,    0x40050030,__READ_WRITE ,__cgu_pll0audio_ctrl_bits);
__IO_REG32_BIT(CGU_PLL0AUDIO_MDIV,    0x40050034,__READ_WRITE ,__cgu_pll0audio_mdiv_bits);
__IO_REG32_BIT(CGU_PLL0AUDIO_NP_DIV,  0x40050038,__READ_WRITE ,__cgu_pll0audio_np_div_bits);
__IO_REG32_BIT(CGU_PLL0AUDIO_FRAC,    0x4005003C,__READ_WRITE ,__cgu_pll0audio_frac_bits);
__IO_REG32_BIT(CGU_PLL1_STAT,         0x40050040,__READ       ,__cgu_pll1_stat_bits);
__IO_REG32_BIT(CGU_PLL1_CTRL,         0x40050044,__READ_WRITE ,__cgu_pll1_ctrl_bits);
__IO_REG32_BIT(CGU_IDIVA_CTRL,        0x40050048,__READ_WRITE ,__cgu_idiva_ctrl_bits);
__IO_REG32_BIT(CGU_IDIVB_CTRL,        0x4005004C,__READ_WRITE ,__cgu_idivx_ctrl_bits);
__IO_REG32_BIT(CGU_IDIVC_CTRL,        0x40050050,__READ_WRITE ,__cgu_idivx_ctrl_bits);
__IO_REG32_BIT(CGU_IDIVD_CTRL,        0x40050054,__READ_WRITE ,__cgu_idivx_ctrl_bits);
__IO_REG32_BIT(CGU_IDIVE_CTRL,        0x40050058,__READ_WRITE ,__cgu_idive_ctrl_bits);
__IO_REG32_BIT(CGU_BASE_SAFE_CLK,     0x4005005C,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_PERIPH_CLK,   0x40050064,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_M4_CLK,       0x4005006C,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_SPIFI_CLK,    0x40050070,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_SPI_CLK,      0x40050074,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_PHY_RX_CLK,   0x40050078,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_PHY_TX_CLK,   0x4005007C,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_APB1_CLK,     0x40050080,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_APB3_CLK,     0x40050084,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_VADC_CLK,     0x4005008C,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_SDIO_CLK,     0x40050090,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_SSP0_CLK,     0x40050094,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_SSP1_CLK,     0x40050098,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_UART0_CLK,    0x4005009C,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_UART1_CLK,    0x400500A0,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_UART2_CLK,    0x400500A4,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_UART3_CLK,    0x400500A8,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_OUT_CLK,      0x400500AC,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32(    CGU_OUTCLK_21_CTRL,    0x400500B0,__READ_WRITE );
__IO_REG32(    CGU_OUTCLK_22_CTRL,    0x400500B4,__READ_WRITE );
__IO_REG32(    CGU_OUTCLK_23_CTRL,    0x400500B8,__READ_WRITE );
__IO_REG32(    CGU_OUTCLK_24_CTRL,    0x400500BC,__READ_WRITE );
__IO_REG32_BIT(CGU_BASE_APLL_CLK,     0x400500C0,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_CGU_OUT0_CLK, 0x400500C4,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_CGU_OUT1_CLK, 0x400500C8,__READ_WRITE ,__cgu_base_xxx_clk_bits);

/***************************************************************************
 **
 ** CCU1
 **
 ***************************************************************************/
__IO_REG32_BIT(CCU1_PM,                        0x40051000,__READ_WRITE ,__ccu_pm_bits);
__IO_REG32_BIT(CCU1_BASE_STAT,                 0x40051004,__READ       ,__ccu1_base_stat_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_BUS_CFG,          0x40051100,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_BUS_STAT,         0x40051104,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_I2C1_CFG,         0x40051108,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_I2C1_STAT,        0x4005110C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_DAC_CFG,          0x40051110,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_DAC_STAT,         0x40051114,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_ADC0_CFG,         0x40051118,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_ADC0_STAT,        0x4005111C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_ADC1_CFG,         0x40051120,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_ADC1_STAT,        0x40051124,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_CAN0_CFG,         0x40051128,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_CAN0_STAT,        0x4005112C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_BUS_CFG,          0x40051200,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_BUS_STAT,         0x40051204,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_MOTOCON_PWM_CFG,  0x40051208,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_MOTOCON_PWM_STAT, 0x4005120C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_I2C0_CFG,         0x40051210,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_I2C0_STAT,        0x40051214,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_I2S_CFG,          0x40051218,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_I2S_STAT,         0x4005121C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_CAN1_CFG,         0x40051220,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_CAN1_STAT,        0x40051224,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_SPIFI_CFG,             0x40051300,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_SPIFI_STAT,            0x40051304,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_BUS_CFG,            0x40051400,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_BUS_STAT,           0x40051404,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SPIFI_CFG,          0x40051408,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SPIFI_STAT,         0x4005140C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_GPIO_CFG,           0x40051410,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_GPIO_STAT,          0x40051414,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_EMC_CFG,            0x40051430,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_EMC_STAT,           0x40051434,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SDIO_CFG,           0x40051438,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SDIO_STAT,          0x4005143C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_DMA_CFG,            0x40051440,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_DMA_STAT,           0x40051444,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_M4CORE_CFG,         0x40051448,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_M4CORE_STAT,        0x4005144C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SCT_CFG,            0x40051468,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SCT_STAT,           0x4005146C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_EMCDIV_CFG,         0x40051478,__READ_WRITE ,__ccu1_clk_emcdiv_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_EMCDIV_STAT,        0x4005147C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_M0APP_CFG,          0x40051490,__READ_WRITE ,__ccu1_clk_emcdiv_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_M0APP_STAT,         0x40051494,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_VADC_CFG,           0x40051498,__READ_WRITE ,__ccu1_clk_emcdiv_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_VADC_STAT,          0x4005149C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_WWDT_CFG,           0x40051500,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_WWDT_STAT,          0x40051504,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART0_CFG,         0x40051508,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART0_STAT,        0x4005150C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_UART1_CFG,          0x40051510,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_UART1_STAT,         0x40051514,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SSP0_CFG,           0x40051518,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SSP0_STAT,          0x4005151C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER0_CFG,         0x40051520,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER0_STAT,        0x40051524,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER1_CFG,         0x40051528,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER1_STAT,        0x4005152C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SCU_CFG,            0x40051530,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SCU_STAT,           0x40051534,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_CREG_CFG,           0x40051538,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_CREG_STAT,          0x4005153C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_RITIMER_CFG,        0x40051600,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_RITIMER_STAT,       0x40051604,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART2_CFG,         0x40051608,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART2_STAT,        0x4005160C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART3_CFG,         0x40051610,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART3_STAT,        0x40051614,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER2_CFG,         0x40051618,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER2_STAT,        0x4005161C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER3_CFG,         0x40051620,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER3_STAT,        0x40051624,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SSP1_CFG,           0x40051628,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SSP1_STAT,          0x4005162C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_BUS_CFG,        0x40051700,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_BUS_STAT,       0x40051704,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_CORE_CFG,       0x40051710,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_CORE_STAT,      0x40051714,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_SGPIO_CFG,      0x40051718,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_SGPIO_STAT,     0x4005171C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_SPI_CFG,               0x40051A00,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_SPI_STAT,              0x40051A04,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_VADC_CFG,              0x40051B00,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_VADC_STAT,             0x40051B04,__READ       ,__ccu_clk_cfg_bits);


/***************************************************************************
 **
 ** CCU2
 **
 ***************************************************************************/
__IO_REG32_BIT(CCU2_PM,                       0x40052000,__READ_WRITE ,__ccu_pm_bits);
__IO_REG32_BIT(CCU2_BASE_STAT,                0x40052004,__READ       ,__ccu2_base_stat_bits);
__IO_REG32_BIT(CCU2_CLK_APLL_CFG,             0x40052100,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APLL_STAT,            0x40052104,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART3_CFG,      0x40052200,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART3_STAT,     0x40052204,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART2_CFG,      0x40052300,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART2_STAT,     0x40052304,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_UART1_CFG,       0x40052400,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_UART1_STAT,      0x40052404,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART0_CFG,      0x40052500,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART0_STAT,     0x40052504,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP1_CFG,        0x40052600,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP1_STAT,       0x40052604,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP0_CFG,        0x40052700,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP0_STAT,       0x40052704,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_SDIO_CFG,             0x40052800,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_SDIO_STAT,            0x40052804,__READ       ,__ccu_clk_cfg_bits);

