una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m0.h
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG0,  0x40101080,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG1,  0x40101084,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG2,  0x40101088,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG3,  0x4010108C,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG4,  0x40101090,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG5,  0x40101094,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG6,  0x40101098,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG7,  0x4010109C,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG8,  0x401010A0,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG9,  0x401010A4,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG10, 0x401010A8,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG11, 0x401010AC,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG12, 0x401010B0,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG13, 0x401010B4,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG14, 0x401010B8,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_SLICE_MUX_CFG15, 0x401010BC,__READ_WRITE,__sgpio_slice_mux_cfgx_bits);

__IO_REG32(    SGPIO_REG0,            0x401010C0,__READ_WRITE);
__IO_REG32(    SGPIO_REG1,            0x401010C4,__READ_WRITE);
__IO_REG32(    SGPIO_REG2,            0x401010C8,__READ_WRITE);
__IO_REG32(    SGPIO_REG3,            0x401010CC,__READ_WRITE);
__IO_REG32(    SGPIO_REG4,            0x401010D0,__READ_WRITE);
__IO_REG32(    SGPIO_REG5,            0x401010D4,__READ_WRITE);
__IO_REG32(    SGPIO_REG6,            0x401010D8,__READ_WRITE);
__IO_REG32(    SGPIO_REG7,            0x401010DC,__READ_WRITE);
__IO_REG32(    SGPIO_REG8,            0x401010E0,__READ_WRITE);
__IO_REG32(    SGPIO_REG9,            0x401010E4,__READ_WRITE);
__IO_REG32(    SGPIO_REG10,           0x401010E8,__READ_WRITE);
__IO_REG32(    SGPIO_REG11,           0x401010EC,__READ_WRITE);
__IO_REG32(    SGPIO_REG12,           0x401010F0,__READ_WRITE);
__IO_REG32(    SGPIO_REG13,           0x401010F4,__READ_WRITE);
__IO_REG32(    SGPIO_REG14,           0x401010F8,__READ_WRITE);
__IO_REG32(    SGPIO_REG15,           0x401010FC,__READ_WRITE);

__IO_REG32(    SGPIO_REG_SS0,         0x40101100,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS1,         0x40101104,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS2,         0x40101108,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS3,         0x4010110C,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS4,         0x40101110,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS5,         0x40101114,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS6,         0x40101118,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS7,         0x4010111C,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS8,         0x40101120,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS9,         0x40101124,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS10,        0x40101128,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS11,        0x4010112C,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS12,        0x40101130,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS13,        0x40101134,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS14,        0x40101138,__READ_WRITE);
__IO_REG32(    SGPIO_REG_SS15,        0x4010113C,__READ_WRITE);

__IO_REG32_BIT(SGPIO_PRESET0,         0x40101140,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET1,         0x40101144,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET2,         0x40101148,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET3,         0x4010114C,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET4,         0x40101150,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET5,         0x40101154,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET6,         0x40101158,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET7,         0x4010115C,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET8,         0x40101160,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET9,         0x40101164,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET10,        0x40101168,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET11,        0x4010116C,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET12,        0x40101170,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET13,        0x40101174,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET14,        0x40101178,__READ_WRITE,__sgpio_presetx_bits);
__IO_REG32_BIT(SGPIO_PRESET15,        0x4010117C,__READ_WRITE,__sgpio_presetx_bits);

__IO_REG32_BIT(SGPIO_COUNT0,          0x40101180,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT1,          0x40101184,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT2,          0x40101188,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT3,          0x4010118C,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT4,          0x40101190,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT5,          0x40101194,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT6,          0x40101198,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT7,          0x4010119C,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT8,          0x401011A0,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT9,          0x401011A4,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT10,         0x401011A8,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT11,         0x401011AC,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT12,         0x401011B0,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT13,         0x401011B4,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT14,         0x401011B8,__READ_WRITE,__sgpio_countx_bits);
__IO_REG32_BIT(SGPIO_COUNT15,         0x401011BC,__READ_WRITE,__sgpio_countx_bits);

__IO_REG32_BIT(SGPIO_POS0,            0x401011C0,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS1,            0x401011C4,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS2,            0x401011C8,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS3,            0x401011CC,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS4,            0x401011D0,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS5,            0x401011D4,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS6,            0x401011D8,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS7,            0x401011DC,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS8,            0x401011E0,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS9,            0x401011E4,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS10,           0x401011E8,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS11,           0x401011EC,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS12,           0x401011F0,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS13,           0x401011F4,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS14,           0x401011F8,__READ_WRITE,__sgpio_posx_bits);
__IO_REG32_BIT(SGPIO_POS15,           0x401011FC,__READ_WRITE,__sgpio_posx_bits);

