una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m0.h
__IO_REG32_BIT(SCT_MATCHREL0,          0x40000200,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL0         SCT_MATCHREL0
#define SCT_CAPCTRL0_bit     SCT_MATCHREL0_bit
#define SCT_MATCHREL0_L      SCT_MATCHREL0_bit.__sct_matchrel_l
#define SCT_MATCHREL0_H      SCT_MATCHREL0_bit.__sct_matchrel_h
#define SCT_CAPCTRL0_L       SCT_MATCHREL0_bit.__sct_capctrl_l
#define SCT_CAPCTRL0_L_bit   SCT_MATCHREL0_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL0_H       SCT_MATCHREL0_bit.__sct_capctrl_h
#define SCT_CAPCTRL0_H_bit   SCT_MATCHREL0_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL1,          0x40000204,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL1         SCT_MATCHREL1
#define SCT_CAPCTRL1_bit     SCT_MATCHREL1_bit
#define SCT_MATCHREL1_L      SCT_MATCHREL1_bit.__sct_matchrel_l
#define SCT_MATCHREL1_H      SCT_MATCHREL1_bit.__sct_matchrel_h
#define SCT_CAPCTRL1_L       SCT_MATCHREL1_bit.__sct_capctrl_l
#define SCT_CAPCTRL1_L_bit   SCT_MATCHREL1_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL1_H       SCT_MATCHREL1_bit.__sct_capctrl_h
#define SCT_CAPCTRL1_H_bit   SCT_MATCHREL1_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL2,          0x40000208,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL2         SCT_MATCHREL2
#define SCT_CAPCTRL2_bit     SCT_MATCHREL2_bit
#define SCT_MATCHREL2_L      SCT_MATCHREL2_bit.__sct_matchrel_l
#define SCT_MATCHREL2_H      SCT_MATCHREL2_bit.__sct_matchrel_h
#define SCT_CAPCTRL2_L       SCT_MATCHREL2_bit.__sct_capctrl_l
#define SCT_CAPCTRL2_L_bit   SCT_MATCHREL2_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL2_H       SCT_MATCHREL2_bit.__sct_capctrl_h
#define SCT_CAPCTRL2_H_bit   SCT_MATCHREL2_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL3,          0x4000020C,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL3         SCT_MATCHREL3
#define SCT_CAPCTRL3_bit     SCT_MATCHREL3_bit
#define SCT_MATCHREL3_L      SCT_MATCHREL3_bit.__sct_matchrel_l
#define SCT_MATCHREL3_H      SCT_MATCHREL3_bit.__sct_matchrel_h
#define SCT_CAPCTRL3_L       SCT_MATCHREL3_bit.__sct_capctrl_l
#define SCT_CAPCTRL3_L_bit   SCT_MATCHREL3_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL3_H       SCT_MATCHREL3_bit.__sct_capctrl_h
#define SCT_CAPCTRL3_H_bit   SCT_MATCHREL3_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL4,          0x40000210,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL4         SCT_MATCHREL4
#define SCT_CAPCTRL4_bit     SCT_MATCHREL4_bit
#define SCT_MATCHREL4_L      SCT_MATCHREL4_bit.__sct_matchrel_l
#define SCT_MATCHREL4_H      SCT_MATCHREL4_bit.__sct_matchrel_h
#define SCT_CAPCTRL4_L       SCT_MATCHREL4_bit.__sct_capctrl_l
#define SCT_CAPCTRL4_L_bit   SCT_MATCHREL4_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL4_H       SCT_MATCHREL4_bit.__sct_capctrl_h
#define SCT_CAPCTRL4_H_bit   SCT_MATCHREL4_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL5,          0x40000214,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL5         SCT_MATCHREL5
#define SCT_CAPCTRL5_bit     SCT_MATCHREL5_bit
#define SCT_MATCHREL5_L      SCT_MATCHREL5_bit.__sct_matchrel_l
#define SCT_MATCHREL5_H      SCT_MATCHREL5_bit.__sct_matchrel_h
#define SCT_CAPCTRL5_L       SCT_MATCHREL5_bit.__sct_capctrl_l
#define SCT_CAPCTRL5_L_bit   SCT_MATCHREL5_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL5_H       SCT_MATCHREL5_bit.__sct_capctrl_h
#define SCT_CAPCTRL5_H_bit   SCT_MATCHREL5_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL6,          0x40000218,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL6         SCT_MATCHREL6
#define SCT_CAPCTRL6_bit     SCT_MATCHREL6_bit
#define SCT_MATCHREL6_L      SCT_MATCHREL6_bit.__sct_matchrel_l
#define SCT_MATCHREL6_H      SCT_MATCHREL6_bit.__sct_matchrel_h
#define SCT_CAPCTRL6_L       SCT_MATCHREL6_bit.__sct_capctrl_l
#define SCT_CAPCTRL6_L_bit   SCT_MATCHREL6_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL6_H       SCT_MATCHREL6_bit.__sct_capctrl_h
#define SCT_CAPCTRL6_H_bit   SCT_MATCHREL6_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL7,          0x4000021C,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL7         SCT_MATCHREL7
#define SCT_CAPCTRL7_bit     SCT_MATCHREL7_bit
#define SCT_MATCHREL7_L      SCT_MATCHREL7_bit.__sct_matchrel_l
#define SCT_MATCHREL7_H      SCT_MATCHREL7_bit.__sct_matchrel_h
#define SCT_CAPCTRL7_L       SCT_MATCHREL7_bit.__sct_capctrl_l
#define SCT_CAPCTRL7_L_bit   SCT_MATCHREL7_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL7_H       SCT_MATCHREL7_bit.__sct_capctrl_h
#define SCT_CAPCTRL7_H_bit   SCT_MATCHREL7_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL8,          0x40000220,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL8         SCT_MATCHREL8
#define SCT_CAPCTRL8_bit     SCT_MATCHREL8_bit
#define SCT_MATCHREL8_L      SCT_MATCHREL8_bit.__sct_matchrel_l
#define SCT_MATCHREL8_H      SCT_MATCHREL8_bit.__sct_matchrel_h
#define SCT_CAPCTRL8_L       SCT_MATCHREL8_bit.__sct_capctrl_l
#define SCT_CAPCTRL8_L_bit   SCT_MATCHREL8_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL8_H       SCT_MATCHREL8_bit.__sct_capctrl_h
#define SCT_CAPCTRL8_H_bit   SCT_MATCHREL8_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL9,          0x40000224,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL9         SCT_MATCHREL9
#define SCT_CAPCTRL9_bit     SCT_MATCHREL9_bit
#define SCT_MATCHREL9_L      SCT_MATCHREL9_bit.__sct_matchrel_l
#define SCT_MATCHREL9_H      SCT_MATCHREL9_bit.__sct_matchrel_h
#define SCT_CAPCTRL9_L       SCT_MATCHREL9_bit.__sct_capctrl_l
#define SCT_CAPCTRL9_L_bit   SCT_MATCHREL9_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL9_H       SCT_MATCHREL9_bit.__sct_capctrl_h
#define SCT_CAPCTRL9_H_bit   SCT_MATCHREL9_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL10,         0x40000228,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL10         SCT_MATCHREL10
#define SCT_CAPCTRL10_bit     SCT_MATCHREL10_bit
#define SCT_MATCHREL10_L      SCT_MATCHREL10_bit.__sct_matchrel_l
#define SCT_MATCHREL10_H      SCT_MATCHREL10_bit.__sct_matchrel_h
#define SCT_CAPCTRL10_L       SCT_MATCHREL10_bit.__sct_capctrl_l
#define SCT_CAPCTRL10_L_bit   SCT_MATCHREL10_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL10_H       SCT_MATCHREL10_bit.__sct_capctrl_h
#define SCT_CAPCTRL10_H_bit   SCT_MATCHREL10_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL11,         0x4000022C,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL11         SCT_MATCHREL11
#define SCT_CAPCTRL11_bit     SCT_MATCHREL11_bit
#define SCT_MATCHREL11_L      SCT_MATCHREL11_bit.__sct_matchrel_l
#define SCT_MATCHREL11_H      SCT_MATCHREL11_bit.__sct_matchrel_h
#define SCT_CAPCTRL11_L       SCT_MATCHREL11_bit.__sct_capctrl_l
#define SCT_CAPCTRL11_L_bit   SCT_MATCHREL11_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL11_H       SCT_MATCHREL11_bit.__sct_capctrl_h
#define SCT_CAPCTRL11_H_bit   SCT_MATCHREL11_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL12,         0x40000230,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL12         SCT_MATCHREL12
#define SCT_CAPCTRL12_bit     SCT_MATCHREL12_bit
#define SCT_MATCHREL12_L      SCT_MATCHREL12_bit.__sct_matchrel_l
#define SCT_MATCHREL12_H      SCT_MATCHREL12_bit.__sct_matchrel_h
#define SCT_CAPCTRL12_L       SCT_MATCHREL12_bit.__sct_capctrl_l
#define SCT_CAPCTRL12_L_bit   SCT_MATCHREL12_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL12_H       SCT_MATCHREL12_bit.__sct_capctrl_h
#define SCT_CAPCTRL12_H_bit   SCT_MATCHREL12_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL13,         0x40000234,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL13         SCT_MATCHREL13
#define SCT_CAPCTRL13_bit     SCT_MATCHREL13_bit
#define SCT_MATCHREL13_L      SCT_MATCHREL13_bit.__sct_matchrel_l
#define SCT_MATCHREL13_H      SCT_MATCHREL13_bit.__sct_matchrel_h
#define SCT_CAPCTRL13_L       SCT_MATCHREL13_bit.__sct_capctrl_l
#define SCT_CAPCTRL13_L_bit   SCT_MATCHREL13_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL13_H       SCT_MATCHREL13_bit.__sct_capctrl_h
#define SCT_CAPCTRL13_H_bit   SCT_MATCHREL13_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL14,         0x40000238,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL14         SCT_MATCHREL14
#define SCT_CAPCTRL14_bit     SCT_MATCHREL14_bit
#define SCT_MATCHREL14_L      SCT_MATCHREL14_bit.__sct_matchrel_l
#define SCT_MATCHREL14_H      SCT_MATCHREL14_bit.__sct_matchrel_h
#define SCT_CAPCTRL14_L       SCT_MATCHREL14_bit.__sct_capctrl_l
#define SCT_CAPCTRL14_L_bit   SCT_MATCHREL14_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL14_H       SCT_MATCHREL14_bit.__sct_capctrl_h
#define SCT_CAPCTRL14_H_bit   SCT_MATCHREL14_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_MATCHREL15,         0x4000023C,__READ_WRITE ,__sct_matchrel_capctrl_bits);
#define SCT_CAPCTRL16         SCT_MATCHREL16
#define SCT_CAPCTRL16_bit     SCT_MATCHREL16_bit
#define SCT_MATCHREL16_L      SCT_MATCHREL16_bit.__sct_matchrel_l
#define SCT_MATCHREL16_H      SCT_MATCHREL16_bit.__sct_matchrel_h
#define SCT_CAPCTRL16_L       SCT_MATCHREL16_bit.__sct_capctrl_l
#define SCT_CAPCTRL16_L_bit   SCT_MATCHREL16_bit.__sct_capctrl_l_bits
#define SCT_CAPCTRL16_H       SCT_MATCHREL16_bit.__sct_capctrl_h
#define SCT_CAPCTRL16_H_bit   SCT_MATCHREL16_bit.__sct_capctrl_h_bits
__IO_REG32_BIT(SCT_EVSTATEMSK0,        0x40000300,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL0,            0x40000304,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK1,        0x40000308,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL1,            0x4000030C,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK2,        0x40000310,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL2,            0x40000314,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK3,        0x40000318,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL3,            0x4000031C,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK4,        0x40000320,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL4,            0x40000324,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK5,        0x40000328,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL5,            0x4000032C,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK6,        0x40000330,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL6,            0x40000334,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK7,        0x40000338,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL7,            0x4000033C,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK8,        0x40000340,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL8,            0x40000344,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK9,        0x40000348,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL9,            0x4000034C,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK10,       0x40000350,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL10,           0x40000354,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK11,       0x40000358,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL11,           0x4000035C,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK12,       0x40000360,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL12,           0x40000364,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK13,       0x40000368,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL13,           0x4000036C,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK14,       0x40000370,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL14,           0x40000374,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_EVSTATEMSK15,       0x40000378,__READ_WRITE ,__sct_evstatemsk_bits);
__IO_REG32_BIT(SCT_EVCTRL15,           0x4000037C,__READ_WRITE ,__sct_evctrl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET0,         0x40000500,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL0,          0x40000504,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET1,         0x40000508,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL1,          0x4000050C,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET2,         0x40000510,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL2,          0x40000514,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET3,         0x40000518,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL3,          0x4000051C,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET4,         0x40000520,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL4,          0x40000524,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET5,         0x40000528,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL5,          0x4000052C,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET6,         0x40000530,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL6,          0x40000534,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET7,         0x40000538,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL7,          0x4000053C,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET8,         0x40000540,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL8,          0x40000544,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET9,         0x40000548,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL9,          0x4000054C,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET10,        0x40000550,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL10,         0x40000554,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET11,        0x40000558,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL11,         0x4000055C,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET12,        0x40000560,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL12,         0x40000564,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET13,        0x40000568,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL13,         0x4000056C,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET14,        0x40000570,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL14,         0x40000574,__READ_WRITE ,__sct_outputcl_bits);
__IO_REG32_BIT(SCT_OUTPUTSET15,        0x40000578,__READ_WRITE ,__sct_outputset_bits);
__IO_REG32_BIT(SCT_OUTPUTCL15,         0x4000057C,__READ_WRITE ,__sct_outputcl_bits);

/***************************************************************************
 **
 ** TIMER0
 **
 ***************************************************************************/
__IO_REG32_BIT(T0IR,                  0x40084000,__READ_WRITE ,__tmr_ir_bits);
__IO_REG32_BIT(T0TCR,                 0x40084004,__READ_WRITE ,__tmr_tcr_bits);
__IO_REG32(    T0TC,                  0x40084008,__READ_WRITE);
__IO_REG32(    T0PR,                  0x4008400C,__READ_WRITE);
__IO_REG32(    T0PC,                  0x40084010,__READ_WRITE);
__IO_REG32_BIT(T0MCR,                 0x40084014,__READ_WRITE ,__tmr_mcr_bits);
__IO_REG32(    T0MR0,                 0x40084018,__READ_WRITE);
__IO_REG32(    T0MR1,                 0x4008401C,__READ_WRITE);
__IO_REG32(    T0MR2,                 0x40084020,__READ_WRITE);
__IO_REG32(    T0MR3,                 0x40084024,__READ_WRITE);
__IO_REG32_BIT(T0CCR,                 0x40084028,__READ_WRITE ,__tmr_tccr_bits);
__IO_REG32(    T0CR0,                 0x4008402C,__READ);
__IO_REG32(    T0CR1,                 0x40084030,__READ);
__IO_REG32(    T0CR2,                 0x40084034,__READ);
__IO_REG32(    T0CR3,                 0x40084038,__READ);
__IO_REG32_BIT(T0EMR,                 0x4008403C,__READ_WRITE ,__tmr_emr_bits);
__IO_REG32_BIT(T0CTCR,                0x40084070,__READ_WRITE ,__tmr_ctcr_bits);

/***************************************************************************
 **
 ** TIMER1
 **
 ***************************************************************************/
__IO_REG32_BIT(T1IR,                  0x40085000,__READ_WRITE ,__tmr_ir_bits);
__IO_REG32_BIT(T1TCR,                 0x40085004,__READ_WRITE ,__tmr_tcr_bits);
__IO_REG32(    T1TC,                  0x40085008,__READ_WRITE);
__IO_REG32(    T1PR,                  0x4008500C,__READ_WRITE);
__IO_REG32(    T1PC,                  0x40085010,__READ_WRITE);
__IO_REG32_BIT(T1MCR,                 0x40085014,__READ_WRITE ,__tmr_mcr_bits);
__IO_REG32(    T1MR0,                 0x40085018,__READ_WRITE);
__IO_REG32(    T1MR1,                 0x4008501C,__READ_WRITE);
__IO_REG32(    T1MR2,                 0x40085020,__READ_WRITE);
__IO_REG32(    T1MR3,                 0x40085024,__READ_WRITE);
__IO_REG32_BIT(T1CCR,                 0x40085028,__READ_WRITE ,__tmr_tccr_bits);
__IO_REG32(    T1CR0,                 0x4008502C,__READ);
__IO_REG32(    T1CR1,                 0x40085030,__READ);
__IO_REG32(    T1CR2,                 0x40085034,__READ);
__IO_REG32(    T1CR3,                 0x40085038,__READ);
__IO_REG32_BIT(T1EMR,                 0x4008503C,__READ_WRITE ,__tmr_emr_bits);
__IO_REG32_BIT(T1CTCR,                0x40085070,__READ_WRITE ,__tmr_ctcr_bits);

/***************************************************************************
 **
 ** TIMER2
 **
 ***************************************************************************/
__IO_REG32_BIT(T2IR,                  0x400C3000,__READ_WRITE ,__tmr_ir_bits);
__IO_REG32_BIT(T2TCR,                 0x400C3004,__READ_WRITE ,__tmr_tcr_bits);
__IO_REG32(    T2TC,                  0x400C3008,__READ_WRITE);
__IO_REG32(    T2PR,                  0x400C300C,__READ_WRITE);
__IO_REG32(    T2PC,                  0x400C3010,__READ_WRITE);
__IO_REG32_BIT(T2MCR,                 0x400C3014,__READ_WRITE ,__tmr_mcr_bits);
__IO_REG32(    T2MR0,                 0x400C3018,__READ_WRITE);
__IO_REG32(    T2MR1,                 0x400C301C,__READ_WRITE);
__IO_REG32(    T2MR2,                 0x400C3020,__READ_WRITE);
__IO_REG32(    T2MR3,                 0x400C3024,__READ_WRITE);
__IO_REG32_BIT(T2CCR,                 0x400C3028,__READ_WRITE ,__tmr_tccr_bits);
__IO_REG32(    T2CR0,                 0x400C302C,__READ);
__IO_REG32(    T2CR1,                 0x400C3030,__READ);
__IO_REG32(    T2CR2,                 0x400C3034,__READ);
__IO_REG32(    T2CR3,                 0x400C3038,__READ);
__IO_REG32_BIT(T2EMR,                 0x400C303C,__READ_WRITE ,__tmr_emr_bits);
__IO_REG32_BIT(T2CTCR,                0x400C3070,__READ_WRITE ,__tmr_ctcr_bits);

/***************************************************************************
 **
 ** TIMER3
 **
 ***************************************************************************/
__IO_REG32_BIT(T3IR,                  0x400C4000,__READ_WRITE ,__tmr_ir_bits);
__IO_REG32_BIT(T3TCR,                 0x400C4004,__READ_WRITE ,__tmr_tcr_bits);
__IO_REG32(    T3TC,                  0x400C4008,__READ_WRITE);
__IO_REG32(    T3PR,                  0x400C400C,__READ_WRITE);
__IO_REG32(    T3PC,                  0x400C4010,__READ_WRITE);
__IO_REG32_BIT(T3MCR,                 0x400C4014,__READ_WRITE ,__tmr_mcr_bits);
__IO_REG32(    T3MR0,                 0x400C4018,__READ_WRITE);
__IO_REG32(    T3MR1,                 0x400C401C,__READ_WRITE);
__IO_REG32(    T3MR2,                 0x400C4020,__READ_WRITE);
__IO_REG32(    T3MR3,                 0x400C4024,__READ_WRITE);
__IO_REG32_BIT(T3CCR,                 0x400C4028,__READ_WRITE ,__tmr_tccr_bits);
__IO_REG32(    T3CR0,                 0x400C402C,__READ);
__IO_REG32(    T3CR1,                 0x400C4030,__READ);
__IO_REG32(    T3CR2,                 0x400C4034,__READ);
__IO_REG32(    T3CR3,                 0x400C4038,__READ);
__IO_REG32_BIT(T3EMR,                 0x400C403C,__READ_WRITE ,__tmr_emr_bits);
__IO_REG32_BIT(T3CTCR,                0x400C4070,__READ_WRITE ,__tmr_ctcr_bits);

/***************************************************************************
 **
 ** Motor control PWM
 **
 ***************************************************************************/
__IO_REG32_BIT(MC_CON,                 0x400A0000,__READ       ,__mc_con_bits);
__IO_REG32(    MC_CON_SET,             0x400A0004,__WRITE      );
__IO_REG32(    MC_CON_CLR,             0x400A0008,__WRITE      );
__IO_REG32_BIT(MC_CAPCON,              0x400A000C,__READ       ,__mc_capcon_bits);
__IO_REG32(    MC_CAPCON_SET,          0x400A0010,__WRITE      );
__IO_REG32(    MC_CAPCON_CLR,          0x400A0014,__WRITE      );
__IO_REG32(    MC_TC0,                 0x400A0018,__READ_WRITE );
__IO_REG32(    MC_TC1,                 0x400A001C,__READ_WRITE );
__IO_REG32(    MC_TC2,                 0x400A0020,__READ_WRITE );
__IO_REG32(    MC_LIM0,                0x400A0024,__READ_WRITE );
__IO_REG32(    MC_LIM1,                0x400A0028,__READ_WRITE );
__IO_REG32(    MC_LIM2,                0x400A002C,__READ_WRITE );
__IO_REG32(    MC_MAT0,                0x400A0030,__READ_WRITE );
__IO_REG32(    MC_MAT1,                0x400A0034,__READ_WRITE );
__IO_REG32(    MC_MAT2,                0x400A0038,__READ_WRITE );
__IO_REG32_BIT(MC_DT,                  0x400A003C,__READ_WRITE ,__mc_dt_bits);
__IO_REG32_BIT(MC_MCCP,                0x400A0040,__READ_WRITE ,__mc_ccp_bits);
__IO_REG32(    MC_CAP0,                0x400A0044,__READ       );
__IO_REG32(    MC_CAP1,                0x400A0048,__READ       );
__IO_REG32(    MC_CAP2,                0x400A004C,__READ       );
__IO_REG32_BIT(MC_INTEN,               0x400A0050,__READ       ,__mc_inten_bits);
__IO_REG32(    MC_INTEN_SET,           0x400A0054,__WRITE      );
__IO_REG32(    MC_INTEN_CLR,           0x400A0058,__WRITE      );
__IO_REG32_BIT(MC_CNTCON,              0x400A005C,__READ       ,__mc_cntcon_bits);
__IO_REG32(    MC_CNTCON_SET,          0x400A0060,__WRITE      );
__IO_REG32(    MC_CNTCON_CLR,          0x400A0064,__WRITE      );
__IO_REG32_BIT(MC_INTF,                0x400A0068,__READ       ,__mc_intf_bits);
__IO_REG32(    MC_INTF_SET,            0x400A006C,__WRITE      );
__IO_REG32(    MC_INTF_CLR,            0x400A0070,__WRITE      );
__IO_REG32(    MC_CAP_CLR,             0x400A0074,__WRITE      );

/***************************************************************************
 **
 ** Repetitive Interrupt Timer
 **
 ***************************************************************************/
__IO_REG32(    RIT_COMPVAL,             0x400C0000,__READ_WRITE );
__IO_REG32(    RIT_MASK,                0x400C0004,__READ_WRITE );
__IO_REG32_BIT(RIT_CTRL,                0x400C0008,__READ_WRITE ,__rit_ctrl_bits);
__IO_REG32(    RIT_COUNTER,             0x400C000C,__READ_WRITE );

